app/controllers/boats_controller.rb

SELECT "boats".* FROM "boats"
---
  def index
    @boats = Boat.all

INSERT INTO "boats" ("name", "description", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "1"], ["description", "jojoj"], ["image", "boat1.jpg"], ["created_at", "2017-10-10 00:19:54.729240"], ["updated_at", "2017-10-10 00:19:54.729240"]]
---
  def create
    @boat = Boat.new(boat_params)

    respond_to do |format|
      if @boat.save

UPDATE "boats" SET "image" = ?, "updated_at" = ? WHERE "boats"."id" = ?  [["image", "boat1.jpg"], ["updated_at", "2017-10-06 06:19:03.204821"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @boat.update(boat_params)

DELETE FROM "boats" WHERE "boats"."id" = ?  [["id", 1]]
---
  def destroy
    @boat.destroy

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_boat
      @boat = Boat.find(params[:id])