app/controllers/captains_controller.rb

INSERT INTO "captains" ("age", "year_experience", "comments", "thursday", "sunday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["age", 20], ["year_experience", 3], ["comments", "no comments"], ["thursday", "t"], ["sunday", "t"], ["created_at", "2017-10-23 16:51:47.900052"], ["updated_at", "2017-10-23 16:51:47.900052"]]
---
  def create
    # Instantiate a new object using form parameters
    @captain = Captain.new(captain_params)
    # Save the object
    if @captain.save